
import asyncio
import os
import sys
import configparser
from aiogram import Bot, Dispatcher, types
from aiogram.types import FSInputFile
from aiogram.filters import CommandStart, Command
from aiogram.exceptions import TelegramUnauthorizedError, TelegramNetworkError
from aiogram.utils.keyboard import InlineKeyboardBuilder
import random
import time
from http.server import HTTPServer, BaseHTTPRequestHandler
import threading



# === 1. Загрузка токена из config.ini ===
config = configparser.ConfigParser()
read_files = config.read(os.path.join(os.path.dirname(__file__), '..', 'config.ini'))
print("Прочитанные файлы:", read_files)

if 'Telegram' not in config or 'TOKEN' not in config['Telegram']:
    print("❌ Ошибка: Не найдена секция [Telegram] или ключ TOKEN в config.ini.")
    sys.exit(1)

TOKEN = config['Telegram']['TOKEN']
print("✅ Токен успешно загружен.")


# === 2. Инициализация бота и диспетчера ===
bot = Bot(token=TOKEN)
dp = Dispatcher()

name_boss = "Пока никого"

# === 3. Обработка команды /start с инлайн-кнопками под сообщением бота ===
@dp.message(CommandStart())
async def greeting(message: types.Message):
    """
    Что делает функция:
        1) Функция приветствует игрока, отправляет фото
        2) Функция погружает игрока в правила игры
        
    Порядок выполнения функции:
        1) Создается переменная text, в которой хранится приветствие и правила игры
        2) Создается переменная name_player, в которой мы узнаем юзернейм игрока
        3) Создается переменная photo с путем к фото
        4) И с помощью answer_photo все соединяется в одно и отправляется пользователю
    """

    user_id = message.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    player = players[user_id]

    caption = f'''Меня зовут Стив.🤖\n
Я — последний выживший из Сектора 13,
сейчас Nite City балансирует на 
грани хаоса, «Инквизиторы» — группировка, превращающая людей в биороботов.\n
Ты — наша последняя надежда.☠\n
Твоя задача — дойти в их главное командующее здание и найти центральный узел...


<b>Правила</b>: 
У тебя есть 1 жизнь на весь путь битвы.❤️

Ты должен уничтожить боссов
с большим количеством здоровья,
чтобы спасти Nite City от Инквизиторов.

Ты можешь сразу пойти в бой и окунутся в битву с головой, но тут будет надежда только на твою удачу.
А можешь прокачать себя, отвечая на вопросы в режиме тренировки, повышая свои шансы на победу

Желаю удачи!✨

<b>На данный момент</b> у тебя есть 3 выбора:
  - Сразу идти в бой, т.е. с головой окунуться в пучину крови и страха;
  - Начать тренировку своего тела чтобы выдержать сильные удары или нанести их;
  - Вернуться на базу чтобы восстановить силы и отдохнуть

<b>Твои текущие показатели</b>:
Текущий уровень урона: {player.damage} ⚔️
Текущий уровень здоровья: {player.health} ❤️
'''
    global name_player
    name_player = message.from_user.username
    gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\The main character.mp4")

    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="⚔️ Идти в бой", callback_data="boss_room_select"),
        types.InlineKeyboardButton(text="💪 Идти в тренировку", callback_data="train_room")
    )
    builder.row(types.InlineKeyboardButton(
    text="Вернуться на базу 🏕️🔥",
    callback_data="back_to_base"
))
    builder.adjust(2)

    await message.answer_animation(
        gif,
        caption=f'Приветствую  <b>{name_player}</b>, {caption}',
        parse_mode="HTML",
        reply_markup=builder.as_markup()
    )



# === 4. Список вопросов для тренировки === 
questions = [
    {
        'question': 'Сколько зубов у человека?🦷',
        'answers': ['25 🦷', '38 🦷', '32 🦷', '27 🦷'],
        'right_answer': '32 🦷',
        'bonus': 3
    },
    {
        'question': 'Какое животное имеет самое большое сердце?❤️',
        'answers': ['Синий кит 🐳', 'Жираф 🦕', 'Медведь 🐂', 'Слон 🐘'],
        'right_answer': 'Синий кит 🐳',
        'bonus': 3
    },
    {
        'question': 'Земля, какая планета по счету от солнца?☀️',
        'answers': ['1️⃣', '3️⃣', '7️⃣', '9️⃣'],
        'right_answer': '3️⃣',
        'bonus': 2
    },
    {
        'question': 'Столица Республики Беларуси 🏰',
        'answers': ['Красноярск ❄️', 'Минск 🏙️', 'Париж 🗼', 'Сыктывкар 🌲'],
        'right_answer': 'Минск 🏙️',
        'bonus': 2
    },
    {
        'question': 'Когда был первый полет в космос? 🚀',
        'answers': ['1961 🌟', '1945 💥', '1999 📱', '2019 📅'],
        'right_answer': '1961 🌟',
        'bonus': 3
    },
    {
        'question': 'Какое насекомое самое опасное? 🦟',
        'answers': ['Муравей жнец 🔥', 'Комар 🩸', 'Иглобрюх 🐡', 'Оса-пуля 💢'],
        'right_answer': 'Муравей жнец 🔥',
        'bonus': 4
    },
    {
        'question': 'Какое животное самое большое в мире? 🙉',
        'answers': ['Жираф 🦒', 'Слон 🐘', 'Медведь 🐻', 'Синий кит 🐳'],
        'right_answer': 'Синий кит 🐳',
        'bonus': 3
    },
    {
        'question': 'У кого самый большой мозг? 🧠',
        'answers': ['Синий кит 🐋', 'Кашалot 🐳', 'Человек 👨', 'Дельфин 🐬'],
        'right_answer': 'Кашалot 🐳',
        'bonus': 3
    },
    {
        'question': 'Кто открыл таблицу Менделеева ⚗️📑',
        'answers': ['Менделеев 🧑', 'Пушкин 🧔', 'Энштейн 👨', 'Тесла 🧒'],
        'right_answer': 'Менделеев 🧑',
        'bonus': 2
    },
    {
        'question': 'Когда создали самый первый фильм 🎬',
        'answers': ['1985 📼', '1799 🏰', '1895 🎥', '1296 🎞'],
        'right_answer': '1895 🎥',
        'bonus': 4
    },
    {
        'question': 'Какое животное самое быстрое 🏃',
        'answers': ['Лев 🦁', 'Кошка 🐱', 'Антилопa 🦌', 'Гепард 🐆'],
        'right_answer': 'Гепард 🐆',
        'bonus': 2
    },
    {
        'question': 'Какое животное самое умное? 🧠',
        'answers': ['Волк 🐺', 'Краб 🦀', 'Черепаха 🐢', 'Дельфин 🐬'],
        'right_answer': 'Дельфин 🐬',
        'bonus': 2
    },
    {
        'question': 'Сколько людей бывало на вершине Эвереста? 🏔️🧗',
        'answers': ['12 884 🏞️', '15 🧗', '1793 🏕️', '7991 🏔️'],
        'right_answer': '12 884 🏞️',
        'bonus': 4
    },
    {
        'question': 'Какая высота Эвереста? ⛰️',
        'answers': ['8848 📏', '12 967 🔝', '5390 🏞️', '1345 🏕️'],
        'right_answer': '8848 📏',
        'bonus': 4
    },
    {
        'question': 'Сколько миллиардов людей в мире? 🌍',
        'answers': ['6 👨🏿‍🤝‍👨🏿', '15 👩🏿‍🤝‍👩🏼', '32 🧑‍🤝‍🧑', '8 👩🏽‍🤝‍👩🏽'],
        'right_answer': '8 👩🏽‍🤝‍👩🏽',
        'bonus': 2
    },
    {
        'question': 'Какое животное самое опасное? ☠️',
        'answers': ['Медведь 🐻', 'Белая акула 🦈', 'Бегемот 🦛', 'Африканский слон 🐘'],
        'right_answer': 'Белая акула 🦈',
        'bonus': 3
    },
    {
        'question': 'Сколько планет в солнечной системе? 🪐',
        'answers': ['5 ✋', '3 🔺', '8 🎱', '13 🧿'],
        'right_answer': '8 🎱',
        'bonus': 2
    },
    {
        'question': 'Какая планета самая большая в солнечной системе 🌌',
        'answers': ['Юпитер 🪐', 'Земля 🌎', 'Нептун 🔵', 'Марс 🔴'],
        'right_answer': 'Юпитер 🪐',
        'bonus': 3
    },
    {
        'question': 'Какая планета дальше всего от Земли? 🌑',
        'answers': ['Марс 🔴', 'Меркурий 🪐', 'Нептун 🔵', 'Уран 🌌'],
        'right_answer': 'Нептун 🔵',
        'bonus': 3
    },
    {
        'question': 'Какая планета состоит из газов? 💨',
        'answers': ['Марс 🔴', 'Юпитер 🪐', 'Земля 🌎', 'Венера 🌌'],
        'right_answer': 'Юпитер 🪐',
        'bonus': 2
    },
    {
        'question': 'Какая планета самая больша в галактике? 🌠🌌',
        'answers': [' TrES-4 ✨', 'Юпитер 🪐', 'Планета Илона Маска 🚀', 'Земля 🌍'],
        'right_answer': ' TrES-4 ✨',
        'bonus': 3
    }
]



# === 5  Вопросы босса ===

boss_questions = [
    {
        'boss_question': 'Правда, что у улитки есть зубы? 🦷',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Правда (на самом деле это так)🐌',
        'boss_right_answer': 'Не плохо, но после битвы зубов у тебя не останется',
        'boss_wrong_answer': 'Ха! Даже улитка умнее тебя. Попробуй не захлебнуться в собственной слюне.'
    },
    {
        'boss_question': 'Правда, что самое тяжёлое вещество на Земле — это свинец? ⚖️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': ' Есть гораздо более плотные элементы, например, осмий или иридий 🪨',
        'boss_right_answer': 'Ты не ведёшься на тяжёлые заблуждения. Хорошо.',
        'boss_wrong_answer': 'Тебя бы в школу обратно. Или в шахту с осмием!'
    },
    {
        'boss_question': 'Правда, что пчелы умеют считать до 5? 🐝',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Это выяснили австралийские и французские учёные 👨‍🔬',
        'boss_right_answer': 'Опасен! Умнее пчёл и больнее их жалишь.',
        'boss_wrong_answer': 'Пчёлы считают, а ты — нет. Кто тут пищащий?'
    },
    {
        'boss_question': 'Правда, что больше людей умерло от кокосов, чем от акул? 🥥',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Правда (на самом деле это так) 🌴🦈',
        'boss_right_answer': 'Ты не попался на акулью пропаганду. Уважение.',
        'boss_wrong_answer': 'Страх — твой хозяин. Даже кокос тебя бы ударил больнее, чем я.'
    },
    {
        'boss_question': 'Правда, что слоны боятся мышей? 🐭🐘',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Это частично подтверждено: слоны пугаются мелких быстро движущихся существ.',
        'boss_right_answer': 'Ты знаешь, даже титаны дрожат перед малым. Ты не промах.',
        'boss_wrong_answer': 'Ну и слон из тебя. Глупый, огромный, и в панике.'
    },
    {
        'boss_question': 'Правда, что на Луне есть ветер? 🌕',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Луне не хватает атмосферы, значит, нет и движения воздуха. 🌌',
        'boss_right_answer': 'Не дышишь в вакууме? Значит, думаешь.',
        'boss_wrong_answer': 'Ветер на Луне? Ты б ещё зонт взял. Тебе и кислорода жалко!'
    },
    {
        'boss_question': 'Правда, что древние греки использовали огурцы как антисептик? 🥒',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Упоминания об использовании сока огурца для заживления есть в древних рецептах 📜',
        'boss_right_answer': 'Ты читаешь древние рецепты? Это не шутка.',
        'boss_wrong_answer': 'Даже Гомер бы тебя переписал. Стыдно за тебя.'
    },
    {
        'boss_question': 'Правда, что мозг чувствует боль? 🧠',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'У самого мозга нет болевых рецепторов ',
        'boss_right_answer': 'Разум без боли — редкий дар. Ты им обладаешь.',
        'boss_wrong_answer': 'Похоже, ты чувствуешь боль умом. Непривычно, да?'
    },
    {
        'boss_question': 'Правда, что человеческое тело на 70% состоит из воды? 💧',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Среднее значение — около 60–70%, особенно у новорождённых 👶',
        'boss_right_answer': 'Разум без боли — редкий дар. Ты им обладаешь.',
        'boss_wrong_answer': 'Похоже, ты чувствуешь боль умом. Непривычно, да?'
    },
    {
        'boss_question': 'Правда, что ты думаешь, что контролируешь свои мысли? 🧘‍♂️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Мысли приходят автоматически, а контроль — иллюзия 🌫️',
        'boss_right_answer': 'Ты понял, кто хозяин твоих мыслей. Это уже сила.',
        'boss_wrong_answer': 'Контролируешь мысли? Не смеши. Даже я их тебе вложил.'
    },
    {
        'boss_question': 'Правда, что верблюды хранят воду в горбах? 🐫',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Горбы — это жировые запасы, а не вода. 🧴',
        'boss_right_answer': 'Знание — твой оазис. Я уже чувствую жажду победы.',
        'boss_wrong_answer': 'Ты бы пил из горба. Повезло, что ты не верблюд.'
    },
    {
        'boss_question': 'Правда, что человеческий мозг может работать даже после смерти тела? 🧬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Нейроактивность сохраняется в течение нескольких минут после клинической смерти ⏱️',
        'boss_right_answer': 'HAMMER-OMEGA: Ты знаешь о жизни после жизни. Опасное знание.',
        'boss_wrong_answer': 'HAMMER-OMEGA Твой мозг уже сдался. Хоронить тебя?'
    },
    {
        'boss_question': 'Правда, что кошки не различают цвета? 🐱',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Кошки — не дальтоники, но видят ограниченное количество цветов 🎨',
        'boss_right_answer': 'У тебя зрение кошки — видишь то, что другие не могут.',
        'boss_wrong_answer': 'Даже кот на тебя смотрит с разочарованием.'
    },
    {
        'boss_question': 'Правда, что на Марсе закаты синие? 🔵',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Из-за тонкой атмосферы и пыли в ней закаты на Марсе действительно голубоватые 🪐',
        'boss_right_answer': 'Ты видел Марс в разуме. Может, ты и не с Земли?',
        'boss_wrong_answer': 'У тебя в голове красный песок. Земной, увы.'
    },
    {
        'boss_question': ' Правда, что пауки — насекомые? 🕷️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Пауки — паукообразные, не насекомые (у них 8 ног, у насекомых — 6) 🕸️',
        'boss_right_answer': '«Ты различаешь даже чужие ноги. Уважаю. Это спасает жизнь чаще, чем ты думаешь.»',
        'boss_wrong_answer': 'Считай ноги, глупец. Ты бы и осьминога назвал жуком.'
    }, 
    {
        'boss_question': 'Правда, что бананы — это ягоды? 🍌',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'С ботанической точки зрения банан — это ягода. 🧪',
        'boss_right_answer': 'Ты знаешь больше, чем обезьяны. Но я всё равно сильнее.',
        'boss_wrong_answer': 'Ха! Даже шимпанзе знает правильный ответ.'
    },
    {
        'boss_question': 'Правда, что в ДНК человека и банана нет общих генов? 🧬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Примерно 50% генов совпадают. �',
        'boss_right_answer': 'Ты почти банан. Почти.',
        'boss_wrong_answer': 'Тебе бы лучше быть бананом — меньше думать.'
    },
    {
        'boss_question': 'Правда, что у человека больше пяти чувств? 👁️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Есть ещё равновесие, термоцепция, проприоцепция и др. 🌀',
        'boss_right_answer': 'Ты чувствуешь опасность. Но я всё равно сильнее.',
        'boss_wrong_answer': 'Ты даже себя не чувствуешь. Жалко.'
    },
    {
        'boss_question': 'Правда, что Венера вращается в ту же сторону, что и Земля? ♀️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Венера вращается ретроградно (в обратную сторону). 🌌',
        'boss_right_answer': 'Ты не ведёшься на стандартное вращение. Хорошо.',
        'boss_wrong_answer': 'Ты бы и Землю заставил вращаться вспять. Ха!'
    },
    {
        'boss_question': 'Правда, что крокодилы плачут от эмоций? 🐊',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Это физиологическая реакция, а не слёзы горя. 😢',
        'boss_right_answer': 'Ты не ведёшься на крокодиловы слёзы. Умно.',
        'boss_wrong_answer': 'Ты бы поверил даже крокодилу. Жалко.'
    },
    {
        'boss_question': 'Правда, что у жирафа больше шейных позвонков, чем у человека? 🦒',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'И у жирафа, и у человека их 7. 🦴',
        'boss_right_answer': 'Ты видишь суть, несмотря на длину. Неплохо.',
        'boss_wrong_answer': 'Ты бы и шею себе сломал, пытаясь додуматься.'
    },
    {
        'boss_question': 'Правда, что пингвины не умеют прыгать? 🐧',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Некоторые виды прыгают выше метра! 🏔️',
        'boss_right_answer': 'Ты знаешь о пингвинах больше, чем они сами.',
        'boss_wrong_answer': 'Даже пингвин бы над тобой посмеялся.'
    },
    {
        'boss_question': 'Правда, что золото нельзя есть? 🏆',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Его используют как пищевую добавку (E175). 🍽️',
        'boss_right_answer': 'Ты знаешь цену золоту. И мне это нравится.',
        'boss_wrong_answer': 'Ты бы даже фольгу жевал. Бедняга.'
    },
    {
        'boss_question': 'Правда, что сердце кита бьётся 100 раз в минуту? 🐋',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'У синего кита пульс всего 9 ударов в минуту. 💓',
        'boss_right_answer': 'Ты спокоен, как кит. Но я всё равно разобью тебя.',
        'boss_wrong_answer': 'Твоё сердце бьётся чаще от страха. Слабак.'
    },
    {
        'boss_question': 'Правда, что в Японии не едят дельфинов? 🐬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'В некоторых регионах их мясо употребляют. 🍙',
        'boss_right_answer': 'Ты знаешь тёмные стороны мира. Опасный.',
        'boss_wrong_answer': 'Ты бы и единорога съел, если б существовал.'
    },
    # Продолжение (11-50) с чередованием "Да"/"Нет":
    {
        'boss_question': 'Правда, что у осьминога три сердца? 🐙',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Два качают кровь к жабрам, одно — к органам. 💙',
        'boss_right_answer': 'Ты многогранен, как осьминог. Но я тебя всё равно съем.',
        'boss_wrong_answer': 'У тебя бы и одного сердца не хватило.'
    },
    {
        'boss_question': 'Правда, что МКС нельзя увидеть невооружённым глазом? 🛰️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Она выглядит как яркая движущаяся звезда. ✨',
        'boss_right_answer': 'Ты следишь за небом. А я слежу за тобой.',
        'boss_wrong_answer': 'Даже космос от тебя прячется.'
    },
        {
        'boss_question': 'Правда, что колибри не умеют летать назад? 🐦',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Они единственные птицы, способные на это! ↪️',
        'boss_right_answer': 'Ты двигаешься вперёд, но помнишь о прошлом.',
        'boss_wrong_answer': 'Ты бы и вперёд-то не полетел. Беспомощный.'
    },
    {
        'boss_question': 'Правда, что в Австралии людей больше, чем кенгуру? 🇦🇺',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Кенгуру в 2 раза больше (50 млн vs 25 млн)! 🦘',
        'boss_right_answer': 'Ты не ведёшься на людские иллюзии. Хорошо.',
        'boss_wrong_answer': 'Ты бы проиграл даже бой с кенгуру.'
    },
    {
        'boss_question': 'Правда, что ленивцы всегда переваривают пищу быстро? 🦥',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Им нужно до месяца, чтобы переварить лист! 🍃',
        'boss_right_answer': 'Ты терпелив, как ленивец. Но я нет.',
        'boss_wrong_answer': 'Ты бы и сам уснул во время пищеварения.'
    },
    {
        'boss_question': 'Правда, что в Древнем Риме мочу использовали для стирки? 🏛️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Аммиак в моче отбеливал одежду. 👕',
        'boss_right_answer': 'Ты чист, как римская тога после стирки.',
        'boss_wrong_answer': 'Ты бы и сам превратился в чистящее средство.'
    },
    {
        'boss_question': 'Правда, что у черепах нет ушей? 🐢',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Есть внутренние уши без раковин. 👂',
        'boss_right_answer': 'Ты слышишь даже то, что другие не замечают.',
        'boss_wrong_answer': 'Ты глух, как... нет, даже черепахи тебя слышат.'
    },
    {
        'boss_question': 'Правда, что в Антарктиде нет рек? 🏔️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Есть подлёдные реки, например, Оникс. �',
        'boss_right_answer': 'Ты видишь скрытые течения. Опасно для меня.',
        'boss_wrong_answer': 'Ты бы замёрз, как айсберг в этой реке.'
    },
    {
        'boss_question': 'Правда, что крысы не могут смеяться? 🐀',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Они смеются на ультразвуке, когда их щекочут. 😆',
        'boss_right_answer': 'Ты слышишь даже крысиный смех. Пугающе.',
        'boss_wrong_answer': 'Ты бы не понял даже шуток крыс.'
    },
    {
        'boss_question': 'Правда, что в ДНК человека нет вирусных генов? 🧬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Около 8% ДНК — остатки древних вирусов. 🦠',
        'boss_right_answer': 'Ты — потомок вирусов. Гордись.',
        'boss_wrong_answer': 'Ты бы и вирусу не понравился.'
    },
    {
        'boss_question': 'Правда, что остров кроликов (Окуносима) — это миф? 🏝️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Он реально существует в Японии! 🐇',
        'boss_right_answer': 'Ты веришь в чудеса. Но я в них не верю.',
        'boss_wrong_answer': 'Ты бы не нашёл его даже с картой.'
    },
    {
        'boss_question': 'Правда, что мёд портится через год? 🍯',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Он может храниться тысячелетиями! 🕰️',
        'boss_right_answer': 'Ты сладок, как мёд, и так же долговечен.',
        'boss_wrong_answer': 'Ты бы испортился быстрее йогурта.'
    },
        {
        'boss_question': 'Правда, что хамелеоны меняют цвет для маскировки? 🦎',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',  # Следующий ответ — "Нет" (чередование!)
        'right_answer_question': 'Основная причина — общение и терморегуляция! 💬',
        'boss_right_answer': 'Ты видишь глубже поверхностных иллюзий. Опасно.',
        'boss_wrong_answer': 'Даже ящерица перехитрила тебя. Печально.'
    },
    {
        'boss_question': 'Правда, что в Древнем Египте фараоны носили парики из металла? 👑',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Парики были из человеческих волос или шерсти животных. 🐑',
        'boss_right_answer': 'Ты не веришь в бредни про "металлические волосы".',
        'boss_wrong_answer': 'Ты бы и золотой парик носил. Безвкусно.'
    },
    {
        'boss_question': 'Правда, что у китов есть пупок? 🐋',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Как и все плацентарные млекопитающие! 🧬',
        'boss_right_answer': 'Ты знаешь, что даже гиганты когда-то были детьми.',
        'boss_wrong_answer': 'Ты бы и у змеи пупок искал. Безнадёжно.'
    },
    {
        'boss_question': 'Правда, что в космосе нет звуков? 🚀',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Звуки есть (например, вибрации плазмы), но их не слышно без спецоборудования. 🔊',
        'boss_right_answer': 'Ты слышишь даже космическую тишину. Жутко.',
        'boss_wrong_answer': 'Ты бы и в вакууме кричал от страха.'
    },
    {
        'boss_question': 'Правда, что в Древнем Риме гладиаторы были вегетарианцами? 🥦',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Их диета состояла из ячменя, бобов и оливкового масла. 🏺',
        'boss_right_answer': 'Ты силён, даже без мяса. Почти как гладиатор.',
        'boss_wrong_answer': 'Тебя бы и вегетарианец победил. Позор.'
    },
    {
        'boss_question': 'Правда, что змеи не чувствуют вкуса еды? 🐍',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Они используют язык и орган Якобсона для "дегустации". 👅',
        'boss_right_answer': 'Ты различаешь вкус правды. Редкий дар.',
        'boss_wrong_answer': 'Ты бы и яд проглотил, не заметив.'
    },
    {
        'boss_question': 'Правда, что в ДНК человека есть гены, отвечающие за хвост? 🧬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Эти гены "выключены", но они существуют! 🦍',
        'boss_right_answer': 'Ты — почти обезьяна. Почти.',
        'boss_wrong_answer': 'Ты бы и хвост отрастил, если б мог.'
    },
    {
        'boss_question': 'Правда, что панды — хищники? 🐼',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Они всеядны, но 99% их рациона — бамбук. 🎍',
        'boss_right_answer': 'Ты не ведёшься на милый облик. Холодный расчёт.',
        'boss_wrong_answer': 'Ты бы и медведя принял за плюшевую игрушку.'
    },
    {
        'boss_question': 'Правда, что в Антарктиде есть действующие вулканы? 🌋',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Например, вулкан Эребус (последнее извержение в 2021). ❄️',
        'boss_right_answer': 'Ты знаешь, что даже лёд скрывает огонь.',
        'boss_wrong_answer': 'Ты бы замёрз у подножия вулкана. Ирония.'
    },
    {
        'boss_question': 'Правда, что у собак нет чувства времени? 🐕',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Они чувствуют время по запахам и ритуалам. ⏳',
        'boss_right_answer': 'Ты понимаешь собак лучше, чем они сами.',
        'boss_wrong_answer': 'Ты бы и день от ночи не отличил.'
    },    {
        'boss_question': 'Правда, что в Древнем Китае были боевые дельфины? 🐬',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Но дельфинов использовали для рыбалки в Полинезии. 🎣',
        'boss_right_answer': 'Ты не веришь в сказки про "дельфинов-убийц".',
        'boss_wrong_answer': 'Ты бы и на золотую рыбку напал. Жалко.'
    },
    {
        'boss_question': 'Правда, что у жирафа самое высокое кровяное давление среди животных? 🦒',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'До 280/180 мм рт.ст. — чтобы качать кровь в мозг! 💉',
        'boss_right_answer': 'Ты держишь голову высоко. Почти как жираф.',
        'boss_wrong_answer': 'Твоё давление падает от одной мысли об этом.'
    },
    {
        'boss_question': 'Правда, что в Древнем Риме не было туалетной бумаги? 🧻',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Использовали губку на палке (tersorium) в общественных туалетах. 🚽',
        'boss_right_answer': 'Ты ценишь современные удобства. Мудро.',
        'boss_wrong_answer': 'Ты бы и губку съел. От отчаяния.'
    },
    {
        'boss_question': 'Правда, что у комаров есть зубы? 🦟',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': '47 зубов! Но они нужны для прокалывания кожи. 🦷',
        'boss_right_answer': 'Ты знаешь, что даже крошечное может быть опасным.',
        'boss_wrong_answer': 'Тебя бы и комар перехитрил. Позор.'
    },
    {
        'boss_question': 'Правда, что в Древнем Египте не знали о существовании мозга? 🧠',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Считали его бесполезным органом и выбрасывали при мумификации. ⚱️',
        'boss_right_answer': 'Ты используешь мозг. В отличие от них.',
        'boss_wrong_answer': 'Ты бы и сам свой мозг выбросил. Бессмысленно.'
    },
    {
        'boss_question': 'Правда, что у кошек нет ключиц? 🐈',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Их плечи крепятся только мышцами — поэтому пролезают в узкие щели. 🌀',
        'boss_right_answer': 'Ты гибок, как кошка. Почти.',
        'boss_wrong_answer': 'Ты бы застрял даже в дверном проёме.'
    },
    {
        'boss_question': 'Правда, что в Средние века люди думали, что Земля плоская? 🌍',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Ещё древние греки знали, что она круглая! 🏛️',
        'boss_right_answer': 'Ты не веришь в глупые мифы. Хорошо.',
        'boss_wrong_answer': 'Ты бы и сейчас на край Земли поплыл.'
    },
    {
        'boss_question': 'Правда, что у человека и гриба больше общих генов, чем у человека и растения? 🍄',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Мы ближе к грибам, чем к дубам! 🌳',
        'boss_right_answer': 'Ты — потомок грибов. Гордись.',
        'boss_wrong_answer': 'Ты бы и гриб перепутал с кактусом.'
    },
    {
        'boss_question': 'Правда, что в Древней Греции олимпийцы соревновались голыми? 🏛️',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Нет ❌',
        'right_answer_question': 'Только в отдельных дисциплинах (например, борьба). 🏺',
        'boss_right_answer': 'Ты знаешь меру даже в древних традициях.',
        'boss_wrong_answer': 'Ты бы и сейчас бегал голым по стадиону.'
    },
    {
        'boss_question': 'Правда, что у птиц нет мочевого пузыря? 🦅',
        'answers': ['Да ✅', 'Нет ❌'],
        'right_answer_yes/no': 'Да ✅',
        'right_answer_question': 'Моча и кал выводятся вместе через клоаку. 💩',
        'boss_right_answer': 'Ты легок, как птица. Почти.',
        'boss_wrong_answer': 'Ты бы и летать не смог с таким балластом.'
    },
]

# Фотки к вопросам
question_images = {
    'Какая высота Эвереста? ⛰️': 'everest.jpg',
    'Сколько миллиардов людей в мире? 🌍': 'world_population.jpg',
    'Какое животное самое опасное? ☠️': 'dangerous_animal.jpg',
    'Сколько планет в солнечной системе? 🪐': 'solar_system.jpg',
    'Какая планета самая большая в солнечной системе 🌌': 'jupiter.jpg',
    'Какая планета дальше всего от Земли? 🌑': 'neptune.jpg',
    'Сколько зубов у человека?🦷': 'teeth.jpg',
    'Какое животное имеет самое большое сердце?❤️': 'blue_whale.jpg',
    'Земля, какая планета по счету от солнца?☀️': 'earth.jpg',
    'Столица Республики Беларуси 🏰': 'minsk.jpg',
    'Когда был первый полет в космос? 🚀': 'space_flight.jpg',
    'Какое насекомое самое опасное? 🦟': 'danger.jpg',
    'Какое животное самое большое в мире? 🙉': 'biggest.jpg',
    'У кого самый большой мозг? 🧠': 'sperm_whale.jpg',
    'Кто открыл таблицу Менделеева ⚗️📑': 'mendeleev.jpg',
    'Когда создали самый первый фильм 🎬': 'first_film.jpg',
    'Какое животное самое быстрое 🏃': 'cheetah.jpg',
    'Какое животное самое умное? 🧠': 'dolphin.jpg',
    'Сколько людей бывало на вершине Эвереста? 🏔️🧗': 'everest_climbers.jpg',
    'Какая планета состоит из газов? 💨' : 'planet_gaz.jpg',
    'Какая планета самая больша в галактике? 🌠🌌': 'tres.jpg',
}

boss_stats = {
    'HAMMER-OMEGA': {
        'name': 'HAMMER-OMEGA',
        'hits_required': 5,  # Количество необходимых ударов
        'base_damage': 7
    },
    'SPIDER-4': {
        'name': 'SPIDER-4',
        'hits_required': 10,  # Больше ударов
        'base_damage': 10
    },
    'INQUISITOR': {
        'name': 'INQUISITOR',
        'hits_required': 15,  # Ещё больше ударов
        'base_damage': 20
    }
}

# === 6. Класс игрока ==

class Player:
    """
    Класс для хранения характеристик игрока
    """
    def __init__(self, user_id: int):
        self.user_id = user_id
        self.damage = 10
        self.health = 100
        self.asked_questions = []  # Список заданных вопросов
        self.current_question = None  # Текущий активный вопрос
        self.suspended_question = None  # Вопрос, на котором прервались
        self.question_counter = 0  # Счетчик вопросов
        self.training_completed = False
        self.question_timestamp = None
        
        """
        Что делается:
            1) класс Player хранит все данные игрока, боя, тренировки и т.д.
            
        Порядок выполнения:
            1) Создаем класс
            2) Инициализируем функцию
            3) Храним все данные
        """
        
        # Для боёв
        self.boss_hits_count = 0  # Добавляем счетчик ударов по текущему боссу
        self.current_boss_max_hits = 0  # Макс. ударов для текущего босса
        self.boss_hits_count = 0  # Счетчик ударов по текущему боссу
        self.current_boss_question = None
        self.all_asked_boss_questions = []  # Все вопросы, заданные за всю игру
        self.asked_boss_questions = []  # список уже заданных вопросов от босса
        self.boss_current_healths = {
            'HAMMER-OMEGA': 100,
            'SPIDER-4': 150,
            'INQUISITOR': 250
        }  # здоровье текущего босса
        self.count_boss = 0  # Добавляем счетчик побежденных боссов
        self.has_seen_entrance_message = False
        self.current_boss = None
        

    def increase_damage(self, amount: int):
        """Увеличивает урон игрока"""
        self.damage += amount
    
    def increase_health(self, amount: int):
        """Увеличивает здоровье игрока"""
        self.health += amount

    def reset_stats(self):
        """Сбрасывает все характеристики игрока"""
        self.all_asked_boss_questions = []
        self.damage = 10
        self.health = 100
        self.asked_questions = []
        self.current_question = None
        self.suspended_question = None
        self.question_counter = 0
        self.training_completed = False
        self.current_boss_question = None
        self.asked_boss_questions = []
        self.boss_health = 100
        self.count_boss = 0
        self.has_seen_entrance_message = False



# === 7. Хранилище игроков ===
players = {}
bosses = {}
defeated_bosses = []



# === 8. Обработка кнопки тренировки ===
@dp.callback_query(lambda c: c.data == 'train')
async def handle_training(callback: types.CallbackQuery):
    try:
        user_id = callback.from_user.id
        if user_id not in players:
            players[user_id] = Player(user_id)
        
        player = players[user_id]

        """
        Что делает функция:
            1) Функция создает тренировку 
            2) Функция увеличивает урон и здоровье игрока в тренировке
            
        Порядок выполнения функции:
            1) Проверяем, завершена ли тренировка
            2) Проверяем, пройдены ли все вопросы и подсчитываем прав. ответы
            3) Создаем клавиатуру с кнопкой "Вернуться на базу 🏕️"
            4) После завершения тренировки высылаем сообщение с поздравлением кол-вом прав-ых ответов
            5) Если не все вопросы заданы задаем их
            6) Выбираем случайный вопрос из неотвеченных с помощью random
            7) Система выдачи вопросов
        """

        # ✅ Проверка: если тренировка уже завершена
        if player.training_completed:
            await callback.message.answer("🏁 Ты уже прошёл тренировку! Отправляйся в бой! ⚔️")
            await callback.answer()
            return

        
        # Проверяем, пройдены ли все вопросы
        if len(player.asked_questions) >= len(questions):
            # Подсчитываем правильные ответы
            correct_answers = sum(1 for q in player.asked_questions 
                               if q.get('answered_correctly', False))
            
            # Создаем клавиатуру с кнопкой
            builder = InlineKeyboardBuilder()
            builder.add(types.InlineKeyboardButton(
                text="Вернуться на базу 🏕️",
                callback_data="back_to_base"
            ))
            
            await callback.message.answer(
                f"🎉 Ты прошел тренировку!\n"
                f"Правильных ответов: {correct_answers} из {len(questions)}\n\n"
                f"Удачи в бою! ⚔️",
                reply_markup=builder.as_markup()
            )
            
            player.question_counter = 0
            player.asked_questions = []
            player.training_completed = True
            return
        
        # Если есть отложенный вопрос - используем его
        if player.suspended_question:
            question_data = player.suspended_question
            player.current_question = question_data
            player.suspended_question = None
        else:
            # Получаем список неотвеченных вопросов
            unanswered_questions = [q for q in questions if q not in player.asked_questions]
            
            if not unanswered_questions:
                # Все вопросы заданы, завершаем тренировку
                correct_answers = sum(1 for q in player.asked_questions 
                    if q.get('answered_correctly') is True)
                
                # Создаем новую клавиатуру
                builder = InlineKeyboardBuilder()
                builder.add(types.InlineKeyboardButton(text="Вернуться на базу 🏕️",callback_data="back_to_base"))
                
                await callback.message.answer(
                    f"🎉На этом твоя тренировка окончена!\n"
                    f"Правильных ответов: {correct_answers} из {len(questions)}\n\n"
                    f"Удачи в бою! ⚔️",
                    reply_markup=builder.as_markup()  # Добавляем клавиатуру к сообщению
                )
                
                player.question_counter = 0
                player.asked_questions = []
                player.training_completed = True
                return
            
            # Выбираем случайный вопрос из неотвеченных
            question_data = random.choice(unanswered_questions)
            player.current_question = question_data
            player.asked_questions.append(question_data)
            player.question_counter += 1
        
        builder = InlineKeyboardBuilder()
        
        # Генерируем кнопки ответов
        for idx, answer in enumerate(question_data['answers']):
            builder.add(types.InlineKeyboardButton(
                text=answer,
                callback_data=f"callback_answers_questions:{id(question_data)}:{idx}"
            ))
        
        builder.row(types.InlineKeyboardButton(
            text="Вернуться на базу 🏕️",
            callback_data="back_to_base"
        ))
        builder.adjust(2)


        # Получаем имя файла
        image_name = question_images.get(question_data['question'], 'default.jpg')
        image_path = fr"C:\Users\valera\Desktop\bot\photos for questions\{image_name}"

        # Проверяем существование файла
        if os.path.exists(image_path):
            try:
                photo = FSInputFile(image_path)
                await callback.message.answer_photo(
                    photo,
                    caption=f"❓ Вопрос {player.question_counter}/{len(questions)}:\n\n{question_data['question']}",
                    reply_markup=builder.as_markup()
                )
            except Exception as e:
                print(f"Ошибка отправки фото: {e}")
                # Отправляем просто текст если не удалось отправить фото
                await callback.message.answer(
                    f"❓ Вопрос {player.question_counter}/{len(questions)}:\n\n{question_data['question']}",
                    reply_markup=builder.as_markup()
                )
        else:
            print(f"Файл не найден: {image_path}")
            # Отправляем просто текст если файл не найден
            await callback.message.answer(
                f"❓ Вопрос {player.question_counter}/{len(questions)}:\n\n{question_data['question']}",
                reply_markup=builder.as_markup()
            )

        await callback.answer()
        
    except Exception as e:
        print(f"Ошибка: {e}")
        await callback.answer("Произошла ошибка")










# === 9. Колбэк на back ===
@dp.callback_query(lambda c: c.data.startswith("back_to_base"))
async def handle_back(callback: types.CallbackQuery):
    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]
    
    """
    Что делает функция:
        1) Функция создает базу отдыха игрока
        2) Функция служит "посредником" между боями тренировкой и т.д.
            
    Порядок выполнения функции:
        1) Проверяем побежденных боссов, через переменную player.count_boss 
        2) Создаем переменную caption с текстом карточки базы 
        3) Определяем гифку в зависимости от количества побежденных боссов
        4) После завершения тренировки высылаем сообщение с поздравлением кол-вом прав-ых ответов
        5) Если не все вопросы заданы задаем их
        6) Создаем клавиатуру с кнопками "Идти в бой" и "Идти в тренировку"
        7) Отправляем карточку
    """
    # Сброс состояния боя с боссом

    player.current_boss_question = None
    player.asked_boss_questions = []
    player.boss_hits_count = 0
    player.current_boss_max_hits = 0
    
    # Сохраняем текущий вопрос как отложенный
    if player.current_question:
        player.suspended_question = player.current_question
        player.current_question = None

    # Формируем текст в зависимости от количества побежденных боссов
    defeated_bosses = []
    if player.count_boss == 0:
        name_boss = ''
    elif player.count_boss == 1:
        name_boss = 'HAMMER-OMEGA'
    elif player.count_boss == 2:
        name_boss = 'HAMMER-OMEGA\nSPIDER-4'
    elif player.count_boss >= 3:
        name_boss = 'HAMMER-OMEGA\nSPIDER-4\nINQUISITOR'
    
    caption = f''' 
🏕️🔥<b>Ты на базе</b>.
    
Идеально время восстановить силы и отдохнуть, 
Если хочешь, можем начать тренировку
или пойти в бой.

<b>Твои текущие показатели</b>:
Текущий уровень урона: {player.damage} ⚔️
Текущий уровень здоровья: {player.health} ❤️

<b>Побежденные инквизиторы</b>:
{name_boss}
'''

    # Определяем гифку в зависимости от количества побежденных боссов
    if player.count_boss >= 2:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Base 3.mp4")
    elif player.count_boss >= 1:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Base 2.mp4")
    else:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Base 1.mp4")

    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="⚔️ Идти в бой", callback_data="boss_room_select"),
        types.InlineKeyboardButton(text="💪 Идти в тренировку", callback_data="train_room")
    )

    await callback.message.answer_animation(
        gif,
        caption=caption,
        reply_markup=builder.as_markup(),
        parse_mode="HTML"
    )
    await callback.answer()















# === 10. Колбэк на train_room ===
@dp.callback_query(lambda c: c.data.startswith("train_room"))
async def handle_train_room(callback: types.CallbackQuery):
    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]

    """
    Что делает функция:
        1) Функция создает карточку тренировочной команыт
        2) Функция служит "посредником" между входом в тренировку и выходом
            
    Порядок выполнения функции:
        1) Создаем переменную caption с текстом карточки тренировки
        2) Создаем клавиатуру с кнопками "Начать тренировку" и "Идти в тренировку"
        3) Отправляем карточку
    """

    caption = f''' 
<u><b>Ты в тренировочной комнате</b></u>,

Идеальное время увеличить наносимый/впитываемый урон.
Правила следующие - Отвечаешь на вопросы, случайным образом увеличиваешь здоровье или урон, за счет своего интелекта.
Чем сложнее вопросы, тем выше показатель увеличения
Если хочешь, можем начать тренировку
или вернуться на базу.
    
<b>Твои текущие показатели</b>:
Текущий уровень урона: {player.damage} ⚔️
Текущий уровень здоровья: {player.health} ❤️
'''
    gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Gym.mp4")
    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="💪 Начать тренировку", callback_data="train"),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
    )

    await callback.message.answer_animation(
        gif,
        caption = caption,
        parse_mode="HTML",
        reply_markup=builder.as_markup())
    await callback.answer()



    



# === 11 Обработка ответов на вопросы ===
@dp.callback_query(lambda c: c.data.startswith("boss_room_select"))
async def boss_room_select(callback: types.CallbackQuery):
    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]

    """
    Что делает функция:
        1) Функция создает карточки для ворот перед боссом
        2) Карточки выходят перед каждым боем
            
    Порядок выполнения функции:
        1) Проверяем, если count_boss = 0, то высылаем ворота HAMMER-OMEGA и также с др.
        2) Создается переменная gif c гиф босса, и caption с его сообщением. 
        3) К каждомым воротам создается клавиатура с Пойти к боссу и Вернуться на базу
        4) И потом высылается карточка
    """

    # Определяем список побежденных боссов   
    if player.count_boss == 0:
        name_boss = ''
    elif player.count_boss == 1:
        name_boss = 'HAMMER-OMEGA'
    elif player.count_boss >= 2:
        name_boss = 'HAMMER-OMEGA\nSPIDER-4'
    elif player.count_boss >= 3:
        name_boss = 'HAMMER-OMEGA\nSPIDER-4\nINQUISITOR'

    if player.count_boss == 0:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Gate to 1 boss.mp4")
        boss_callback = "boss1_hello"
        caption =f'''
Ты у входа на территорию <b>Инквизиторов</b>. 👊🏼🤖👊🏼

Впереди тебя ждет один из трех сильнейших Инквизиторов Nite City.
Его кулаки превращают города в пыль
Он просто монстр, будь осторожен
От слабейшего к сильнейшему.
Правила просты, либо ты побеждаешь - либо тебя

<b>Как победить?</b>:
Чтобы победить Инквизитора,
Ты должен отвечать на его вопросы.
Ответ: да или нет.
За правильный ответ ты будешь наносить ему урон,
За неправильный — он тебе.
И помни, будь осторожен, ты человек!
У тебя всего лишь одна жизнь...

Удачи в битве!⚔🛡

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️

<b>Побежденные инквизиторы</b>:
{name_boss}
'''
        builder = InlineKeyboardBuilder()
        builder.add(
        types.InlineKeyboardButton(
            text="👊🏼🤖👊🏼 Пойти к боссу", 
            callback_data=boss_callback
    ),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
)
        builder.adjust(2)

    elif player.count_boss == 1:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Gate to 2 boss.mp4")
        boss_callback = "boss2_hello"
        caption=f'''
Ты у входа на территорию <b>SPIDER-4</b>. 🕸🕷

Впереди тебя ждет один из cильнейших Инквизиторов Nite City.
Это 8-ми ногий паук-убийца
Правила просты, либо ты побеждаешь - либо тебя

<b>Как победить?</b>:
Чтобы победить Инквизитора,
Ты должен отвечать на его вопросы.
Ответ: да или нет.
За правильный ответ ты будешь наносить ему урон,
За неправильный — он тебе.
И помни, будь осторожен, ты человек!
У тебя всего лишь одна жизнь...

Удачи в битве!⚔🛡

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️

<b>Побежденные инквизиторы</b>:
{name_boss}
'''
        builder = InlineKeyboardBuilder()
        builder.add(
        types.InlineKeyboardButton(
            text="🕷🕸 Пойти к боссу", 
            callback_data=boss_callback
    ),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
)
        builder.adjust(2)

    elif player.count_boss == 2:
        gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Gate to 3 boss.mp4")
        boss_callback = "boss3_hello"
        caption=f'''
Ты у входа на территорию <b>INQUISITOR</b>. ⛩️⚔

Впереди тебя ждет самый cильнейших Инквизитор Nite City.
Венец творения, разрушитель городов
Самое сильнейшее существо во всем мире
Правила просты, либо ты побеждаешь - либо тебя

<b>Как победить?</b>:
Чтобы победить Инквизитора,
Ты должен отвечать на его вопросы.
Ответ: да или нет.
За правильный ответ ты будешь наносить ему урон,
За неправильный — он тебе.
Это самый сильный босс, он очень опасен!
Будь осторожен, не забывай, ты человек!
У тебя всего лишь одна жизнь...

Удачи в битве!⚔🛡

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️

<b>Побежденные инквизиторы</b>:
{name_boss}
'''
        builder = InlineKeyboardBuilder()
        builder.add(
        types.InlineKeyboardButton(
            text="🗡✧︎👨‍💻 Пойти к боссу", 
            callback_data=boss_callback
    ),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
)
        builder.adjust(2)
    else:
        # Если все боссы уже побеждены
        await callback.message.answer("🎉 Ты уже победил всех боссов! Отдыхай, герой!")
        await callback.answer()
        return

    boss_callback = "boss1_hello" if player.count_boss == 0 else "boss2_hello" if player.count_boss == 1 else "boss3_hello"



    await callback.message.answer_animation(
        gif,
        caption = caption,
        parse_mode="HTML",
        reply_markup=builder.as_markup()
    )
    await callback.answer()

# Новая функция для обработки выбора босса
@dp.callback_query(lambda c: c.data.startswith("boss_hello_selection"))
async def boss_hello_selection(callback: types.CallbackQuery):
    try:
        user_id = callback.from_user.id
        if user_id not in players:
            players[user_id] = Player(user_id)
        
        player = players[user_id]
        
        # Проверяем, что это не "boss_fight"
        if callback.data == "boss_fight_answers":
            await boss_fight_answers(callback)
            return
            
        boss_num = int(callback.data.split("_")[1])
        
        if boss_num == 0:
            await boss1_hello(callback)
        elif boss_num == 1:
            await boss2_hello(callback)
        else:
            await boss3_hello(callback)
    except Exception as e:
        print(f"Ошибка в boss_hello_selection: {e}")
        await callback.answer("Произошла ошибка", show_alert=True)





# === 12 Второй босс ===
@dp.callback_query(lambda c: c.data.startswith("boss2_hello"))
async def boss2_hello(callback: types.CallbackQuery):

    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]

    """
    Что делает функция:
        1) Функция создает карточку босса перед боем
        2) Карточки босса выходят перед каждым боем
            
    Порядок выполнения функции:
        1) Создаем переменную boss_health, в которой устанавливаем его урон
        2) Создается переменная gif c гиф босса, и caption с его сообщением. 
        3) К каждому боссу создается клавиатура с Начать битву и Вернуться на базу
        4) И потом высылается карточка
    """

    boss_health = player.damage * 10  # Вместо 150

    gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 2.mp4")
    caption =f'''
<b>Я — SPIDER-4</b>🕷🕸.

Первый из перерожденных.
Ты — просто мясо для переработки.
Ночной Город будет очищен.
Твои кости сломаются,
плоть растворится, а сознание
станет частью Великой Сети.
Беги. Пока можешь."

Начнем битву? 😈


<b>Показатели босса</b>: 
Урон: 7 ⚔️
Здоровье: {boss_health} ❤️

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️
'''
    
    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="☠⚔🩸 Начать битву", callback_data="boss_fight_answers"),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
    )

    builder.row(types.InlineKeyboardButton(
        text="⛩️ Вернуться к входу ",
        callback_data="boss_room_select"
))
    builder.adjust(2)

    await callback.message.answer_animation(
        gif,
        caption = caption,
        reply_markup=builder.as_markup(),
        parse_mode="HTML"
    )
    await callback.answer()



# === 13 Первый босс ===
@dp.callback_query(lambda c: c.data.startswith("boss1_hello"))
async def boss1_hello(callback: types.CallbackQuery):

    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]
    
    """
    Что делает функция:
        1) Функция создает карточку босса перед боем
        2) Карточки босса выходят перед каждым боем
            
    Порядок выполнения функции:
        1) Создаем переменную boss_health, в которой устанавливаем его урон
        2) Создается переменная gif c гиф босса, и caption с его сообщением. 
        3) К каждому боссу создается клавиатура с Начать битву и Вернуться на базу
        4) И потом высылается карточка
    """

    boss_health = player.damage * 5

    gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 1.mp4")
    caption = f'''
Я — <b>HAMMER-OMEGA</b> 👊🏼🤖👊🏼

Кузнец новой эры, мои кулаки
превращают города в пыль.
Инквизиторы дали мне силу, чтобы
раздавить любую угрозу.
 
Ты не герой, ты — ошибка, которую я исправлю. 
Этот удар будет последним.☠

Начнем битву? 😈


<b>Показатели босса</b>: 
Урон: 10 ⚔️
Здоровье: {boss_health} ❤️

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️
'''

    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="☠⚔🩸 Начать битву", callback_data="boss_fight_answers"),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
    )

    builder.row(types.InlineKeyboardButton(
        text="⛩️ Вернуться к входу ",
        callback_data="boss_room_select"
))
    builder.adjust(2)

    await callback.message.answer_animation(
        gif,
        caption = caption,
        reply_markup=builder.as_markup(),
        parse_mode="HTML"
    )
    await callback.answer()

# === 14 Третий босс ===
@dp.callback_query(lambda c: c.data.startswith("boss3_hello"))
async def boss3_hello(callback: types.CallbackQuery):
    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    
    player = players[user_id]

    """
    Что делает функция:
        1) Функция создает карточку босса перед боем
        2) Карточки босса выходят перед каждым боем
            
    Порядок выполнения функции:
        1) Создаем переменную boss_health, в которой устанавливаем его урон
        2) Создается переменная gif c гиф босса, и caption с его сообщением. 
        3) К каждому боссу создается клавиатура с Начать битву и Вернуться на базу
        4) И потом высылается карточка
    """

    boss_health = player.damage * 15  # Вместо 250

    gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 3.mp4")
    caption =f'''
<b>Я — INQUISITOR</b>𓆩✧︎𓆪

Я - Венец творения.
Ты веришь, что сражаешься за свободу?
Свобода — иллюзия. Каждая твоя мысль,
Каждый шаг — часть алгоритма.
Город падет. Мир падет. 
Ты будешь смотреть, как это происходит...

Начнем битву? 😈

<b>Показатели босса</b>: 
Урон: 20 ⚔️
Здоровье: {boss_health} ❤️

<b>Твои показатели</b>:
Текущий урон: {player.damage} ⚔️
Текущее здоровье: {player.health} ❤️
'''
    
    builder = InlineKeyboardBuilder()
    builder.add(
        types.InlineKeyboardButton(text="☠⚔🩸 Начать битву", callback_data="boss_fight_answers"),
        types.InlineKeyboardButton(text="🏕️ Вернуться на базу", callback_data="back_to_base")
    )
    builder.row(types.InlineKeyboardButton(
        text="⛩️ Вернуться к входу",
        callback_data="boss_room_select"
    ))
    builder.adjust(2)

    await callback.message.answer_animation(
        gif,
        caption=caption,
        reply_markup=builder.as_markup(),
        parse_mode="HTML"
    )
    await callback.answer()


# === 15 Вопросы на файт с боссом ===
@dp.callback_query(lambda c: c.data.startswith("boss_fight_answers"))
async def boss_fight_answers(callback: types.CallbackQuery):
    user_id = callback.from_user.id
    if user_id not in players:
        players[user_id] = Player(user_id)
    global unanswered_boss_questions
    player = players[user_id]
    player.question_timestamp = time.time()

    """
    Что делает функция:
        1) Функция задает вопросы босса игроку
        2) Вопросы задаются рандомно и не повторяются
            
    Порядок выполнения функции:
        1) Определяем текущего босса
        2) Получаем параметры босса
        3) Инициализируем здоровье босса только если бой только начался
        4) Выбираем только вопросы, которые ЕЩЁ НИКОМУ не задавались
        5) Выбираем случайный вопрос
        6) И высылаем карточку
    """

    # Определяем текущего босса
    if player.count_boss == 0:
        boss_name = "HAMMER-OMEGA"
    elif player.count_boss == 1:
        boss_name = "SPIDER-4"
    else:
        boss_name = "INQUISITOR"
    
    # Получаем параметры босса
    hits_required = boss_stats[boss_name]['hits_required']
    boss_damage = boss_stats[boss_name]['base_damage']
    
    # Инициализируем здоровье босса только если бой только начался
    if player.current_boss != boss_name:
        player.current_boss = boss_name
        player.current_boss_max_hits = hits_required
        player.boss_hits_count = 0
        player.boss_current_healths[boss_name] = player.damage * hits_required

    # Выбираем только вопросы, которые ЕЩЁ НИКОМУ не задавались
    unanswered_questions = [
        q for q in boss_questions 
        if q not in player.all_asked_boss_questions
    ]
    
    # Если вопросы закончились — начинаем заново (или выдаем сообщение)
    if not unanswered_questions:
        await callback.answer("Все вопросы исчерпаны! Список сброшен.", show_alert=True)
        player.all_asked_boss_questions = []  # Очищаем историю
        unanswered_questions = boss_questions.copy()  # Берём все вопросы снова
    
    # Выбираем случайный вопрос
    boss_question = random.choice(unanswered_questions)
    player.current_boss_question = boss_question
    player.all_asked_boss_questions.append(boss_question)  # Запоминаем вопрос

    builder = InlineKeyboardBuilder()
    for idx, answer in enumerate(boss_question['answers']):
        builder.add(types.InlineKeyboardButton(
            text=answer,
            callback_data=f"boss_callback_answers_{idx}"
        ))
    builder.row(types.InlineKeyboardButton(
            text="Вернуться на базу 🏕️",
            callback_data="back_to_base"
        ))
    builder.adjust(2)

    await callback.message.answer(
        f"{'<b>HAMMER-OMEGA</b>' if player.count_boss == 0 else '<b>SPIDER-4</b>' if player.count_boss == 1 else '<b>INQUISITOR</b>'}: {boss_question['boss_question']}",
        reply_markup=builder.as_markup(),
        parse_mode="HTML"
    )
    await callback.answer()

        






# === 16 Обработка ответов на вопросы ===
@dp.callback_query(lambda c: c.data.startswith("boss_callback_answers"))
async def boss_callback_answers(callback: types.CallbackQuery):
    try:
        user_id = callback.from_user.id
        if user_id not in players:
            players[user_id] = Player(user_id)

        player = players[user_id]
        boss_question = player.current_boss_question

        """
        Что делает функция:
            1) Функция обрабатывает ответы на вопросы босса
            2) Вопросы задаются рандомно и не повторяются
            
        Порядок выполнения функции:
            1) Определяем текущего босса
            2) Получаем параметры босса
            3) Создаем переменные с текстом для карточки босса
            4) Обработка правильного ответа, высылаем карточку нанесения урона
            5) Обработка неправильного ответа, высылаем карточку получения урона
            6) В случае проигрыша высылаем карточку поражения
            7) В случае победы высылаем карточку победы
        """

        if not boss_question:
            await callback.answer("Вопрос босса не найден", show_alert=True)
            return

        # Определяем текущего босса
        if player.count_boss == 0:
            boss_name = "HAMMER-OMEGA"
        elif player.count_boss == 1:
            boss_name = "SPIDER-4"
        else:
            boss_name = "INQUISITOR"
            
       # Получаем параметры босса
        required_hits = boss_stats[boss_name]['hits_required']
        boss_damage = boss_stats[boss_name]['base_damage']

        # Получаем ответ игрока
        answer_idx = int(callback.data.split("_")[-1])
        user_answer = boss_question['answers'][answer_idx]
        is_correct = user_answer == boss_question['right_answer_yes/no']


        damage_dealt = player.damage
        current_health = player.boss_current_healths[boss_name]
            
          

        # Проверяем победу
        boss_defeated = player.boss_hits_count >= required_hits or player.boss_current_healths[boss_name] <= 0
        if boss_defeated:
            player.boss_current_healths[boss_name] = 0
 
 
        response = boss_question['boss_right_answer'] if is_correct else boss_question['boss_wrong_answer']

        boss_exclamations = [
            'АЙ, Неприятно!',
            'БОЛЬНО!!!',
            'Ты пожалеешь об этом!',
            'Я это запомню!',
            'Это ещё не конец!',
            'Как ты смеешь?!',
            'О, это было ниже пояса!',
            'Зачем так жёстко?!',
            'Ты смеешь ранить меня?!',
            'Теперь моя очередь!',
            'Ты за это заплатишь!'
        ]

        boss_pain = [
            'Чувствуешь боль?',
            'Получай, людишка!',
            'Ты так слаб',
            'Больно, да?',
            'Ты безнадежен',
            'Ты не уйдешь отсюда живым!',
            'Победа уже у меня в кармане!',
            'Я думал ты будешь посильнее',
            'Ты жалок!',
            'Последние слова?'
        ]

        # Обработка правильного ответа
        if is_correct:
            player.current_boss = boss_name
            if player.current_boss == "HAMMER-OMEGA":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 1 is beaten.mp4")
            elif player.current_boss == "SPIDER-4":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 2 is beaten.mp4")
            elif player.current_boss == "INQUISITOR":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 3 is beaten.mp4")

            player.boss_current_healths[boss_name] -= damage_dealt
            random_exclamation = random.choice(boss_exclamations)
            message = f'''
<b>{'HAMMER-OMEGA' if player.count_boss == 0 else 'SPIDER-4' if player.count_boss == 1 else 'INQUISITOR'}</b>: {random_exclamation}
Я чувствую, как мое здоровье стало меньше на {damage_dealt} единиц!
{response}
{boss_question.get('right_answer_question', '')}

<b>Система</b>:
Здоровье босса: {max(player.boss_current_healths[boss_name], 0)} ❤️
Твое здоровье: {player.health} ❤️
'''
        else:
            if player.count_boss == 0:
                name_boss = 'Пока никого'
            elif player.count_boss == 1:
                name_boss = 'HAMMER-OMEGA'
            elif player.count_boss >= 2:
                name_boss = 'HAMMER-OMEGA\nSPIDER-4'
            elif player.count_boss >= 3:
                name_boss = 'HAMMER-OMEGA\nSPIDER-4\nINQUISITOR'
                
            # Обработка неправильного ответа
            player.current_boss = boss_name 
            if player.current_boss == "HAMMER-OMEGA":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 1 hits.mp4")
            elif player.current_boss == "SPIDER-4":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 2 hits.mp4")
            elif player.current_boss == "INQUISITOR":
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 3 hits.mp4")

            player.health -= boss_damage
            random_boss_punch = random.choice(boss_pain)
            message = f'''
<b>{'HAMMER-OMEGA' if player.count_boss == 0 else 'SPIDER-4' if player.count_boss == 1 else 'INQUISITOR'}</b>: {random_boss_punch}
Я уменьшил твое здоровье на {boss_damage} единиц!
{response}
{boss_question.get('right_answer_question', '')}    

<b>Система</b>:
Здоровье босса: {max(player.boss_current_healths[boss_name], 0)} ❤️
Твое здоровье: {player.health} ❤️
'''

        player.current_boss_question = None
        await callback.message.answer_animation(
            gif,
            caption = message,
            parse_mode="HTML")

        if player.health <= 0:
            # Сохраняем имя текущего босса для сообщения
            current_boss = 'HAMMER-OMEGA' if player.count_boss == 0 else 'SPIDER-4' if player.count_boss == 1 else 'INQUISITOR'
            
            # Сбрасываем характеристики
            player.reset_stats()
            
            # Отправляем сообщение о поражении
            try:
                gif = FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\You've lost.mp4")
            except:
                gif = None  # Если фото не загрузилось
            
            text = f"""
☠️ <b>Ты проиграл!</b>

{current_boss} убил тебя. 
Весь твой прогресс сброшен.
Ты не смог одолеть Инквизиторов и они
Захватили весь город.
Жители вынуждены бежать, а кто остались -
Живут в страхе.

<b>Начнем игру сначала?</b>🎮🕹
"""

            builder = InlineKeyboardBuilder()
            builder.add(
                types.InlineKeyboardButton(
                    text="Начать игру сначала🎮🕹", 
                    callback_data="back_to_base"
                )
            )
            
            if gif:
                await callback.message.answer_animation(
                    gif,
                    caption = text,  # Используем caption вместо text для фото
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )
            else:
                await callback.message.answer(
                    text,
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )
            return

        # Если босс повержен — поздравление + кнопка
        # При победе над боссом сбрасываем счетчик ударов
        if player.boss_current_healths[boss_name] <= 0:
            player.boss_hits_count = 0
            player.count_boss += 1

            builder = InlineKeyboardBuilder()
            builder.add(
                types.InlineKeyboardButton(
                    text="🏕️ Вернуться на базу", 
                    callback_data="back_to_base"
                )
            )

            if player.count_boss == 1:
                caption = "🎉 <b>Поздравляю! Ты победил HAMMER-OMEGA!</b>\n"
                gif= FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 1 death.mp4")
                

                await callback.message.answer_animation(
                    gif,
                    caption = caption,
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )
            elif player.count_boss == 2:
                caption = "🎉 <b>Невероятно! Ты победил SPIDER-4!</b>\n"
                gif= FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 2 death.mp4")

                await callback.message.answer_animation(
                    gif,
                    caption = caption,
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )
            else:
                caption = "🎉 <b>Невероятно! Ты победил INQUISITOR</b>\n"
                gif= FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Boss 3 death.mp4")

                await callback.message.answer_animation(
                    gif,
                    caption = caption,
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )

                gif= FSInputFile(r"C:\Users\valera\Desktop\bot\GIF\Victory.mp4")
                caption=f"""
🎉 <b>Ты победил всех боссов! Игра пройдена!</b>

<b>Стив</b>: "Приветствую тебя, легенда <b>Nite City</b>.
Ты сделал это… Ты прошел сквозь ад,
который не смог пережить никто.
Инквизиторы повержены, их центральный узел уничтожен,
а их черные схемы навсегда стерты из системы.
Ты не просто выжил — ты сломал саму машину угнетения."

🔹 Ты стоял на руинах их цитадели, пока дождь из искр
падал с неба, как слезы поверженного титана.
🔹 Твои удары рвали броню, твоя воля
ломала алгоритмы страха.
🔹 Ты стал бурей, против которой не устоял даже их главный исполин — «<b>INQUISITOR</b>».

<b>Nite City дышит свободно</b>.

Люди, которых они хотели превратить
в бездушные шестерёнки,
теперь снова видят солнце. Тени отступают.
Система перезагружается… но уже без них.

Ты не просто выполнил миссию.
Ты переписал историю.

<b>Твои итоговые показатели</b>:
☠️ Уничтожено боссов: 3/3
⚔️ Твой урон: {player.damage} 
❤️ Твое здоровье: {player.health} """
                
                await callback.message.answer_animation(
                    gif,
                    caption = caption,
                    parse_mode="HTML",
                    reply_markup=builder.as_markup()
                )
            return  # Выход — следующий вопрос не нужен

        # Если бой продолжается — задаем следующий вопрос
        await boss_fight_answers(callback)


    except Exception as e:
        print(f"Ошибка в boss_callback_answers: {e}")
        await callback.answer("Произошла ошибка", show_alert=True)
    finally:
        await callback.answer()

# === 17 Обработка ответов на вопросы ===
@dp.callback_query(lambda c: c.data.startswith('callback_answers_question'))
async def callback_answers_question(callback: types.CallbackQuery):
    try:
        user_id = callback.from_user.id
        if user_id not in players:
            players[user_id] = Player(user_id)
        
        player = players[user_id]
        parts = callback.data.split(':')
        question_id = int(parts[1])
        answer_idx = int(parts[2])
        
        """
        Что делает функция:
            1) Функция обрабатывает ответы на вопросы тренировки
            
        Порядок выполнения функции:
            1) Проверяем, что ответ относится к текущему вопросу
            2) Если ответ правильный, то рандомно прибавляем урон и здоровье, также в противном случаем
            3) Создаем переменную для правильных вопросов, чтобы выдать правильные ответы в конце
            4) Запоминаем вопрос и отом задаем его пользователю
        """

        if len(parts) < 3:
            raise ValueError("Неверный формат callback_data")
            
        question_id = int(parts[1])
        answer_idx = int(parts[2])
        
        # Проверяем, что ответ относится к текущему вопросу
        if not player.current_question or id(player.current_question) != question_id:
            await callback.answer("Этот вопрос уже неактуален", show_alert=True)
            return
            
        user_answer = player.current_question['answers'][answer_idx]
        is_correct = user_answer == player.current_question['right_answer']
        
        if is_correct:
            bonus = player.current_question['bonus']
            if random.choice([True, False]):
                player.increase_damage(bonus)
                message = f"✅ Правильно!\nПрибавился урон +{bonus}!\n\nТекущий урон: {player.damage} ⚔️\nТекущее здоровье: {player.health} ❤️"
            else:
                player.increase_health(bonus)
                message = f"✅ Правильно!\nПрибавилось здоровье +{bonus}!\n\nТекущий урон: {player.damage} ⚔️\nТекущее здоровье: {player.health} ❤️"
        else:
            message = f"❌ Неверно! \n\nТекущий урон: {player.damage} ⚔️\nТекущее здоровье: {player.health} ❤️"
        
        # Помечаем вопрос как отвеченный (правильно/неправильно)
        player.current_question['answered_correctly'] = is_correct
        
        await callback.message.answer(message)
        
        
        # Сбрасываем текущий вопрос
        if player.current_question:
            player.current_question['answered_correctly'] = is_correct



        player.current_question = None
        player.suspended_question = None
        
        # Задаем новый вопрос
        await handle_training(callback)
        
    except Exception as e:
        print(f"Ошибка в callback_answers_question : {e}")
        await callback.answer("Ошибка обработки ответа", show_alert=True)
    finally:
        await callback.answer()



# === 18 Главная асинхронная функция запуска ===
async def main():
    """
    Функция запуска бота
    """
    try:
        me = await bot.get_me()
        print(f"✅ Бот {me.username} успешно запущен.")
        await dp.start_polling(bot)
    except TelegramUnauthorizedError:
        print("❌ Ошибка: Неверный токен Telegram.")
    except TelegramNetworkError:
        print("❌ Ошибка сети при подключении к Telegram.")
    except Exception as e:
        print(f"❌ Неизвестная ошибка: {e}")


# === 19 Точка входа ===
if __name__ == '__main__':
    asyncio.run(main())

import asyncio
from aiogram import Bot, types
from aiogram.types import InputFile
from aiogram import Bot, Dispatcher
from aiogram.types import Message, InputFile
from aiogram.filters import CommandStart, Command
from aiogram.types import FSInputFile

bot = Bot(token='7970424106:AAGt_99D7xo52pY8dcRcWrddNQXLhirhYkI')
dp = Dispatcher()



@dp.message(CommandStart())
async def greeting(message: types.Message):

    """
    Что делает функция:
        1) Функция приветствует игрока, отправляет фото
        2) Функция погружает игрока в правила игры
        
    Порядок выполнения функции:
        1) Создается переменная text, в которой хранится приветствие и правила игры
        2) Создается переменная name_player, в которой мы узнаем юзернейм игрока
        3) Создается переменная photo с путем к фото
        4) И с помощью answer_photo все соединяется в одно и отправляется пользователю
    """

    text = '''Меня зовут Стив.\n
Я — последний выживший из Сектора 13,
сейчас Ночной Город балансирует на 
грани хаоса, «Инквизиторы» - группировка, превращающая людей в биороботов.\n
Ты — наша последняя надежда.\n
Твоя задача — дойти в их главно командующее здание и найти центральный узел...'''
    name_player =  message.from_user.username
    photo = FSInputFile(r"C:\Users\valera\Desktop\bot\photo\Основной персонаж.jpg")
    await message.answer_photo(photo, caption=f'Приветствую {name_player}, {text}')
    




async def main():
    await dp.start_polling(bot)

if __name__ == '__main__':
    asyncio.run(main())  # Правильный способ запуска асинхронного кода

